cases/chpt5-tubeBatch-30/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// This is for gallium in cavity

phaseChange true;
tubeCapture true;
airTop false;
outerTubeKill true;
alpha1TControl 1.0;
alphaInterfaceCut 1;
meltInterface 1e-6;
alpha2Capture 0.0005;

//phases (Phase1 Phase2);
phases (Phase1 Phase2 Phase3);

sigma12         0;//1.5;//.15;//.15;//0.0001;
sigma13         0;//1.5;//0.0015;//0.15;
sigma23         0;
sigmaMetal      0.005;//0.15;//
sigmaMetalFlag  1.0;//1.5;
/*
*/
D23             0;

k [1 1 -3 -1 0 0 0] 1;//0;
nu [0 2 -1 0 0 0 0] 2.98e-07;
rho [1 -3 0 0 0 0 0] 6000;
cp [0 2 -2 -1 0 0 0] 381.5;

nuEM    1;//2.97e-07;
k       16.3; 
//k k [1 1 -3 1 0 0 0] 1; // kg*m/s^3*k
/*
*/
k1 0.02;
k2 25;//24; //24 liquid, 40 solid?
k3  40;//40;//40;
nu1_shadow 1.48e-05;
nu2_shadow 2.97e-07;
nu3_shadow 3e-07;

k_weld 0;//40; 

multiplierBuoy 8e8;
multiplierBuoyG 1e4;//1.6e6;
sourceTime 0;

dmdtRelaxAlpha 10;//2.5;
dmdtRelaxPressure 0;//-0.25;//-0.005;//.03;//25;//-0.005;

cp1 1000;
cp2 965;
cp3 530;

SuFudge 0;
testFudge 0.0;

dsigmadT 0;

meltingT 1940;

T_0 1940;

cp 600;

rhoRef 4500;

htot htot [1 -1 -2 0 0 0 0] 1;

Lf 295e3;//334000; // water

//LfLimit true;
//LfSmoothing true;

Tref 1940;


vsfRho true;
beta 0;//1.96e-5;

Phase1 // air
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             1;
    cp              1000;
//    cp              381.5;
    k               0.02;
    Pr              0.74;
}

Phase2 // ice
{
    transportModel  Newtonian;
    Tref            1940;
    beta            0;//0.77;
    nu              1.156e-6; 
    rho             4500;
    cp              964.9; // from TPP ASME (11.042*4.184)/(0.04788)
    k               31;
}

Phase3 // water
{
    transportModel  Newtonian;
    Tdep            true;
    Shomate         false;
    CTLE            0;//1e-6;
    nu              1.156e-6; 
    rho             4500;
    cp              600;
    a               461.4;
    b               0.2097;
    c               0;//-0.00002;
    k               31;
}

// ************************************************************************* //
